Revit 2026 API

# PhaseArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PhaseArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
PhaseArrayIterator()
```
```fsharp
new : unit -> PhaseArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

PhaseArrayIterator Class

Autodesk.Revit.DB Namespace